{
    "url": "https://www.amazon.co.uk/Cordless-Screwdriver-MYMULIKE-Rechargeable-Furniture/dp/B09SPYQXFQ/ref=sr_1_5?crid=6OP69GJEV6QI&dib=eyJ2IjoiMSJ9.OBD8BnFEf4igurLNRScLyDOeGG5E99EJF_E6-tZ1KBJdVtmO6iVqK6Glnqs24s0Wh59CS_LLxEZ38LmwOQkAogUo60MLiYfYyMBBJvFXbhMikZ1UKpZuctxOZFqBVBZlnYaaq3XLAJz1LYe_FMvjyDFz14Wvjg1jh2pMZ3iXq-vANR_REnbvGbaz_7NgSLqNxnElQ8VtBEglNGF59vcjAEKeBXlBno7zPmLTblDRSg2STnWR4MVdwXFagp2WD_XsPbCc8fZThPC-z9RXwYci8le2c5VF7FQd_JSizVUXA88.gCe-r9WfJuppuxY4EZqilrRgR0gtMgaAYOjG43OIbGk&dib_tag=se&keywords=electric%2Bscrew%2Bdriver&nsdOptOutParam=true&qid=1728822625&sprefix=electric%2Bsscrew%2Bdriver%2Caps%2C100&sr=8-5&th=1",
    "text": "Skip to main content\n.co.uk\nDelivering to Oldham OL2\nUpdate location\nAll\nAll Departments\nAlexa Skills\nAmazon Devices\nAmazon Fresh\nAmazon Global Store\nAmazon Resale\nApps & Games\nAudible Audiobooks\nBaby\nBeauty\nBooks\nCar & Motorbike\nCDs & Vinyl\nClassical Music\nCo-op\nComputers & Accessories\nDeals\nDigital Music\nDIY & Tools\nDVD & Blu-ray\nElectronics & Photo\nFashion\n   Women\n   Men\n   Girls\n   Boys\n   Baby\nGarden & Outdoors\nGift Cards\nGrocery\nHandmade\nHealth & Personal Care\nHome & Business Services\nHome & Kitchen\nIndustrial & Scientific\nKindle Store\nLarge Appliances\nLighting\nLuggage and travel gear\nLuxury Stores\nMorrisons\nMusical Instruments & DJ Equipment\nPC & Video Games\nPet Supplies\nPremium Beauty\nPrime Video\nSoftware\nSports & Outdoors\nStationery & Office Supplies\nSubscribe & Save\nToys & Games\nHello, sign in\nAccount & Lists\nReturns\n& Orders\n0\nBasket\nAll\nGrocery\nBest Sellers\nNew Releases\nToday's Deals\nPrime\nMusic\nPrime Video\nBooks\nHome & Garden\nDIY & Tools\nDeals & Savings\nPower Tools\nHand Tools\nGarden Tools\nHardware & Supplies\nElectrical\nDecorating\nPaint Finder\nKitchen & Bathroom\nSafety & Security\nTrade & Professional\nSponsored\nPower, Garden & Hand Tools\n›\nPower Tools\n›\nDrills\n›\nDrill Drivers\nDelivery\nPickup\n£13\n99\nFREE Returns\nFREE delivery Wednesday, 16 October on your first order to UK or Ireland. Details\nOr fastest delivery Tomorrow, 14 October. Order within 5 hrs 14 mins. Details\nDelivering to Oldham OL2 – Update location\nIn stock\nQuantity:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\nQuantity:1\n\nAdd to Basket\nBuy Now\nDispatches from\nAmazon\nSold by\nLCDYCR STORE\nReturns\nReturnable within 30 days of receipt\nPayment\nSecure transaction\nAdd gift options\nAdd to List\n\n\nSponsored\n\nClick to open expanded view\n5 VIDEOS\nElectric Drill Screwdriver, 47 in 1 Portable Cordless Screwdriver Set Rotated 90 Degrees Electric Screwdrivers Cordless Handle with Led Worklight and Charger for Home Office DIY Tools\nVisit the MYMULIKE Store\n4.2\n624 ratings\nAmazon's\nChoice\n500+ bought in past month\n£13\n99\nFREE Returns\nColour Name: Black\n£13.99\n£13.99\n£13.99\nBrand MYMULIKE\nPower source Corded Electric\nMaximum rotational speed 180 RPM\nVoltage 3.6 Volts\nAmperage 3.6 Amps\nAbout this item\n【MAX TORQUE 3N·m WITH SUPER POWER AND QUICK CHANGE CHUCK】The maximum torque of our electric screwdriver is 3 N·m and is suitable for screwing and drilling in the home. The quick change chuck makes it easy to replace accessories. With positive and negative switch is easy for installation and removal of screws. 220RPM rotational speed provides plenty of power for a variety of applications, making it an ideal companion for homework tasks.\n【LED LIGHT AND ALSO AS A FLASHLIGHT】The front LED light is good for dark environments or dark corners. It can also be used as a flashlight for lighting in dark places. The handle can be adjusted in two positions. Press and hold the lock button to rotate the handle position, which is suitable for use in confined spaces. With the storage box is easy to carry and store your cordless screwdriver and accessories.\n【WITH CHARGING ADAPTER AND Easy Charging】our electric screwdriver cordless if featured with battery.The battery offers great capacity and longer life. The USB micro charging cable and adapter suitable for various USB ports such as computer output ports, charging time 2-5 hours.\n【Durable and Easy to Charge】With Charging Adapter - large capacity and a longer lifespan. The USB micro charging cable and adapter are suitable for various USB ports such as computer output ports, and the charging time is 2-4 hours.\n【Gift 47-Pieces Accessories & Portable Storage Box】 Including：The most commonly found home and office screwdriver sizes and types. 1x Electric Screwdriver Drill;1x USB Charging Cord；1 x Flexible Hex Shaft,；28 x Short Screwdriver Bits; 8 x Socket Wrenchs (5-12mm)；4 x Long Screwdriver Bits; 2 x Twist drill bits;1 x Sleeve Connecting\n› See more product details\n  Report an issue with this product\nSponsored\nFrequently bought together\nThis item: Electric Drill Screwdriver, 47 in 1 Portable Cordless Screwdriver Set Rotated 90 Degrees Electric Screwdrivers Cordless Handle with Led Worklight and Charger for Home Office DIY Tools\n£13\n99\n+\n210 Pcs Wood Screws Assortment Set, Self Tapping Countersunk Head Screws, Self Drilling Cross Flat Head Brass Zinc Screws for Wood, with 20 Pcs M6 Screw Anchors\n£5\n88\nTotal price: \n£19.87\nAdd both to Cart\nThese items are dispatched from and sold by different sellers.\nShow details\nProducts related to this item\nSponsored\nHANMATEK Electric Screwdriver Cordless Screwdriver Tool Rotated 90 Degrees with Rec...\n6,232\n£16\n99\nElectric Cordless Screwdriver,MQUPIN 47-in-1 Drill Driver Screwdriver Set,3.6V…\n93\n£14\n99\nDuroFort 8V Cordless Electric Screwdriver Set, 10+1 Torque Power Screwdriver Set wi...\n57\n£37\n99\nSave 20% with voucher\nGoldsea Electric Screwdriver Cordless, Cordless Drill & Screwdriver Set, 47 in…\n69\n£23\n99\nSave 10% with voucher\nVastar 7.2V Cordless Screwdriver, Electric Power Screwdriver Set with Rechargeable ...\n1,017\n£36\n99\nSave 10% with voucher\nElectric Cordless Screwdriver Set Kiprim 4V Rechargeable Adjustable Torque…\n3,683\n£27\n99\nHi-Spec 27 Pc Electric Screwdriver Pink 3.6V with 23 Drill Bit Set for Women. Cordl...\n9,871\n£19\n99\nFrom the brand\nAs a professional manufacturer of electrical tools,such as drills,power screwdrivers,heat gun,rotary tool kit,drill bit set and other tools supplies.We're devoted to the most innovative research and unique designes for the handicraft enthusiast member of your family.Our products are designed to help both owners and their family get more convenient of daily life\ncordless screwdriver\nProduct Description\nHigh-Performance Motor\nEquipped with a higher-performance motor that can amplify effectivity and supply safety. Delivers 3.5Nm max torque and no load pace of 250 RPM for a fastening overall performance or light drilling on wood.\n1/4\" Quick Magnetic Chuck\n1/4 inch magnetic chuck allows the furnished bits to be shortly modified out but nevertheless, be securely held in. Accept any 1/4-inch hex-shank accessories for drilling and driving.\nForward/Reverse Switch\nErgonomically placed forward/reverse, and locked positions for safety towards misoperation. It allows you to either screw or replace/remove bits for your purposes, which will make your work extra efficient.\nLED Light\nFront LED light enables you to safely screw in hard-to-see areas, so the workplace is continually lit and honestly visible.\n47pcs Accessories Set\n1pcs cordless screwdriver, 1 x 200mm magnetic tender shaft, 1 x 50mm magnetic extension bar, 1 x sleeve connecting rod, 43pcs accessories, 1 x toolbox\nCarrying Case\nA transportable storage case makes the drill/driver bits organized and handy for you to work at every place.\nThis electric screwdriver is well-suited for pursuing household tasks. It is very convenient, lightweight(only 0.8 lbs), compact, and powerful. It’s designed with 3.5Nm max torque, no load speed of 250 RPM, a 2-position pivoting handle, can convert from straight to the pistol grip, LED work light, and 43pcs add-ons In addition, a portable screw bits storage box makes the magnetic bits prepared and raise it to in all places in any time. Perfect for duties around the home, garage, garden, and workshop\nLooking for specific info?\nProduct information\nTechnical Details\nManufacturer MQFORU\nPackage Dimensions 23 x 16.9 x 6 cm; 440 g\nColour Black\nPower Source Corded Electric\nVoltage 3.6 Volts\nTorque 3 Newton Meters\nSpeed 220 RPM\nSpecial Features Portable, Cordless, Rechargeable\nBatteries included? No\nBatteries Required? No\nBattery Cell Type Lithium Ion\nItem Weight 440 g\nAdditional Information\nASIN B09SPYQXFQ\nCustomer Reviews 4.2\n624 ratings\n4.2 out of 5 stars\nBest Sellers Rank 1,013 in DIY & Tools (See Top 100 in DIY & Tools)\n1 in Drill Drivers\nDelivery information: We cannot deliver certain products outside mainland UK ( Details). We will only be able to confirm if this product can be delivered to your chosen address when you enter your delivery address at checkout.\nDate First Available 17 Feb. 2022\nWarranty & Support\nAmazon.com Return Policy:Regardless of your statutory right of withdrawal, you enjoy a 30-day right of return for many products. For exceptions and conditions, see Return details.\nFeedback\nWould you like to tell us about a lower price?\nProduct guides and documents\nInstructions for Use (IFU) (PDF)\nCompare with similar items\nThis Item\nMYMULIKE Electric Drill Screwdriver, 47 in 1 Portable Cordless Screwdriver Set Rotated 90 Degrees Electric Screwdrivers Cordless Handle with Led Worklight and Charger for Home Office DIY Tools\nRecommendations\nJENABOM 47 in 1 Electric Screwdriver Cordless, Cordless Screwdriver Bits Set Rechargeable, 3.6V Li-ion 3.5N·m Max Torque Electric Rotatable Drill Screwdriver for Home Improvement DIY Project\n MQFORU Cordless Screwdriver, 47 in 1 Portable Cordless Drills, 3.6V Rechargeable Electric Screwdriver Kit, Dual Position Handle with USB Cable LED Light for Home Office DIY Tools\n DEWINNER Electric Cordless Screwdriver, Drill Driver Set, USB 3.6V 6N·m Max Torque with 1300 mAh Battery & 45 Piece Screwdriver and Wood Bit Assortment\nAdd to Basket\nAdd to Basket\nAdd to Basket\nAdd to Basket\nPrice\n£13\n99 -9% \n£19\n99\nRRP: £21.99\n£13\n99\n£20\n99\nDelivery\nGet it as soon as Wednesday, Oct 16\nGet it as soon as Wednesday, Oct 16\nGet it as soon as Wednesday, Oct 16\nGet it as soon as Wednesday, Oct 16\nCustomer Ratings\n4.2\n624\n4.2\n1,896\n4.2\n1,165\n4.3\n1,094\nSold By\nLCDYCR STORE\nJENABOM\nFMLJJ STORE\nYUAN GENGQIANG STORE\nPower Source\nCorded Electric\nBattery Powered\nBattery Powered\nBattery Powered\nMaximum Power\n—\n600 watts\n4 watts\n600 watts\nSpeed\n220 rpm\n250 rpm\n250 rpm\n230 rpm\nVoltage\n3.6 volts\n3.6 volts of direct current\n3.6 volts\n4.8 volts\nItem Torque\n3 newton meters\n3.5 newton meters\n3 newton meters\n6 newton meters\nAmperage\n3.6 amps\n300 milliamps\n2 amps\n1300 milliamps\nWeight\n0.44 kilograms\n—\n—\n—\nMore from frequently bought brands\nSponsored\nBosch Professional 18V System GDX 18V-210 C Cordless Impact Driver (max. Torque of ...\n579\n£170\n00\nJENABOM Electric Screwdriver Cordless, Electric Screwdriver Kit with 14 Accessories...\n18\n£12\n59\nHOTO Electric Screwdriver Set, 3.6V Rechargeable Screwdriver Set with…\n43\n£59\n99\nC P CHANTPOWER Cordless Electric Screwdriver Set, 6 +1 Torque Setting…\n629\n£25\n99\nSave £3.00 with voucher\nVastar 7.2V Cordless Screwdriver, Electric Power Screwdriver Set with Rechargeable ...\n1,017\n£36\n99\nSave 10% with voucher\nHi-Spec 27 Pc Electric Screwdriver Pink 3.6V with 23 Drill Bit Set for Women. Cordl...\n9,871\n£19\n99\nC P CHANTPOWER Cordless Drill Set, 20V Electric Power Drill Driver with Battery and...\n536\n£49\n99\nSave 15% with voucher\nSponsored\nSponsored\nHYCHIKA Electric Screwdriver, 6Nm Torque Cordless Screwdriver 2000mAh 3.6V with 35 Accessories, LED Light and Rear Flashlight, USB Cable and Storage Box\n3,309\n£23.75RRP:\n£26.99\nCordless Drill Driver Set 21V, Power Hammer Drill with 2 Batteries 2000mAh, 25+3 Torque, 42N.m Max, 3/8\" Chuck Electric Drill, 2 Speed, LED Light, 30pcs Accessories, Battery Drill Set for Home DIY\n239\n£68.89\nNEU MASTER Cordless Screwdriver, Electric Screwdriver Rechargeable Power Screwdriver with Pivoting Handle, 6+1 Torque Setting,USB Cable, LED Light,32pcs Bits, 2000 mAh Battery\n137\n£32.99\nCustomer reviews\n4.2 out of 5\n624 global ratings\n5 star\n59%\n4 star\n21%\n3 star\n11%\n2 star\n5%\n1 star\n5%\nHow customer reviews and ratings work\nSponsored\nCustomers say\nCustomers like the utility and value of the drill. They mention it's a handy gadget and ideal for home handymen. Customers appreciate its compactness, ease of use, and versatility. However, some customers have mixed opinions on the battery life, functionality, and quality.\nAI-generated from the text of customer reviews\nSelect to learn more\nUtility\nValue for money\nCompactness\nEase of use\nVersatility\nBattery life\nFunctionality\nQuality\n\nReviews with images\nSee all photos\nTop reviews\nMost recent\nTop reviews\nTop reviews from United Kingdom\nShoppingaddict\nPerfect for around the house!\nReviewed in the United Kingdom on 17 September 2024\nVerified Purchase\nI've been using this cordless screwdriver for a few weeks now and I'm really impressed with its versatility. It's perfect for a variety of tasks, from assembling furniture to tackling small DIY projects around the house. The battery lasts well, and it's so easy to use.\n\nThe screwdriver is surprisingly powerful for its size, and it handles most screws with ease.\n\nThe only downside I've found is that it can struggle a bit with undoing really tight screws. You might need to give it a little extra muscle to get them out.\nOverall, I'm very happy with this screwdriver. It's designed well, lightweight, convenient, and does a great job.\nHelpful\nReport\nCharlotte M.\nNot bad for the money\nReviewed in the United Kingdom on 13 August 2024\nColour Name: BlackVerified Purchase\nNot a professional tool but perfectly adequate for home/DIY use. Feels a bit flimsy but has reasonable torque.\nHelpful\nReport\nEmily Ward\nRechargeable drill.\nReviewed in the United Kingdom on 3 October 2024\nVerified Purchase\nLove this, it's helped me with DIY around the house. Loads of extra bits. For the price it was an excellent buy. Bargin\nHelpful\nReport\nGlamorepuss\nFantastic Tool for DIY Enthusiasts\nReviewed in the United Kingdom on 25 April 2024\nVerified Purchase\nI recently purchased the Pink Cordless Screwdriver with 40 Extra Pieces, and I must say, I absolutely love it! As someone who enjoys tackling DIY projects around the house, this tool has quickly become an essential part of my toolkit.\n\nFirst off, the color is just adorable – the vibrant pink adds a fun touch to my collection of tools. But beyond aesthetics, this screwdriver is incredibly functional. The cordless design makes it convenient to use anywhere without being attached to a plug, and the ergonomic adjustable handle provides a comfortable grip for extended use.\n\nThe 40 extra pieces and the handy little box to keep everything in is a fantastic bonus. With a variety of bits and attachments included, I have everything I need to tackle a wide range of tasks, from assembling furniture to hanging shelves.\n\nI was pleasantly surprised by the power and efficiency of this screwdriver. It effortlessly drives screws into various materials without stripping or slipping, saving me time and frustration.\n\nOverall, I can't recommend this Pink Cordless Screwdriver enough. It's stylish, reliable, and versatile – perfect for DIY enthusiasts of all skill levels. Whether you're a seasoned handyperson or a beginner looking to tackle your first project, this tool is a must-have addition to your toolbox.\nRead more\n4 people found this helpful\nHelpful\nReport\nYouYu\nIts a toy not tool\nReviewed in the United Kingdom on 27 August 2024\nVerified Purchase\nI was really disappointed with this cordless screwdriver. First, while it claims to be 47-in-1, the actual quality of the attachments is terrible. The bits wear out quickly and become loose after only a few uses. Secondly, the 3 N.m torque is far too weak. It struggles with anything more than light screws and is basically useless for tougher jobs.\n\nThe battery life is another major issue. It barely lasts an hour, and recharging takes forever, making it very inconvenient to use. The LED light is also not bright enough, offering little help when working in dimly lit areas. While the pink design may look cute, it feels like they focused more on the appearance than functionality.\n\nOverall, this screwdriver fails to perform even basic household tasks, and I wouldn’t recommend it to anyone.\n2 people found this helpful\nHelpful\nReport\nCd\nCompact\nReviewed in the United Kingdom on 25 September 2024\nColour Name: OrangeVerified Purchase\nThis is a great little drill/screwdriver, perfect for me with Multiple Sclerosis as I don't have strength to undo or tighten screws with a manual screwdriver. Great for little jobs around the house. Easy to use, does the job perfectly and comes in a compact case with everything required inside. Arrived promptly.\nHelpful\nReport\nAmazon Customer\nSaves the effort.\nReviewed in the United Kingdom on 1 August 2024\nColour Name: BlackVerified Purchase\nDoes the job for when you have a job that involves lots of screwdriver action. Not the most powerful, but it is relatively inexpensive.\nOne person found this helpful\nHelpful\nReport\nJon\nSurprisingly good quality at this price-point.\nReviewed in the United Kingdom on 13 July 2024\nColour Name: BlackVerified Purchase\nWhen I placed the order for this product I was not expecting too much at this price-point. I was surprised :-) The quality of the product is excellent. The torque is good in that it will defeat even the hardest environment, but not so severe that it will sprain your wrist - that is very good. The assortment of screw heads is comprehensive and should be able to fit any type of screw and the addition of bolt and nut heads is an added bonus. The set includes two long drill bits, which I have already found to be very handy. The flexible bit extension is a brilliant idea and I have already used it several times to access difficult to reach areas. The battery charges via USB which is convenient as it can be charged from any compatible USB power source, including a PC or laptop. After a full charge the battery will last for several hours of work. All of this housed in a nice, strong plastic, custom-made box.....what more could one want for that jobs around the house.\nRecommend? - Yes. Purchase again? - if I ever need another electric drill set, absolutely I would purchase again.\n5 people found this helpful\nHelpful\nReport\nSee more reviews\nTop reviews from other countries\nTranslate all reviews to English\nvardhman jain\nWorks great and excited for my DIY\nReviewed in the United States on 6 June 2024\nVerified Purchase\nI bought this product a month back and it is working great since then for my DIY project\nElectric Screwdriver is a versatile and user-friendly tool designed . It designed to make fastening and loosening screws a breeze.\n\nI worked with on TV mount, wooden shelf and many more yet to come\n\nPros:\n1. Power and Performance**: it suitable for various tasks, from assembling furniture to more demanding projects.\n2. Battery Life**: : efficient and can be used for long\n3. Ergonomic Design**: The lightweight and compact design, coupled with a comfortable grip, reduces hand fatigue and enhances control during use.\n4. Adjustable Speed and Torque**: Multiple speed settings and adjustable torque levels provide flexibility for different applications, ensuring the right amount of power for each task.\n5. Bit Set and Storage Case**: Comes with a comprehensive set of screwdriver bits and a convenient storage case, making it easy to keep everything organized and accessible.\nRead more\nReport\nrosa\naun no lo e probavo, pero me a llegado con casi todo fuera de su sitio\nReviewed in Spain on 18 May 2024\nColour Name: BlackVerified Purchase\nel producto en si no e podido probarlo aun, pero me a fastidiado mucho que la mayoría de accesorios iban sueltos por la caja y parecía unas maracas antes de abrirla.\nReport\nTranslate review to English\nThe Saints\nFamily treasure!\nReviewed in the United States on 24 August 2024\nVerified Purchase\nwe love it all - has all the attachment to satisfy the hubs, it is lightweight so wife can use it without extra workout, ad it is so easy to use that our 9yo gets excited about home remmodelling projects. I used to be DeWalt girl, bit this is compact space saver and it does the job great. Would buy again, but I hope itr is sturdy enough to last us few years ;)\nReport\nKishan Patel\nGood product\nReviewed in the United States on 26 June 2024\nVerified Purchase\nIt a great product\nReport\nThiccxe\nGUYS I LOVE MY SCREWDRIVER SET\nReviewed in the United States on 26 September 2024\nVerified Purchase\nI’ve been living on my own for about 2 1/2 years now (I’m 25) and I bought my very own kit and lemme tell u I mean I guess I could’ve gotten it Ina more girly color but I am so happy with my purchase it works like a charm and I haven’t had any problems,\n\nIs very easy to use, comes with many sizes, the power lasts very well to me as well\nReport\nSee more reviews\nSponsored\n\n\nBack to top\nGet to Know Us\nCareers\nAbout Us\nUK Modern Slavery Statement\nSustainability\nAmazon Science\nMake Money with Us\nSell on Amazon\nSell on Amazon Business\nSell on Amazon Handmade\nSell on Amazon Launchpad\nSupply to Amazon\nProtect and build your brand\nAssociates Programme\nFulfilment by Amazon\nSeller Fulfilled Prime\nAdvertise Your Products\nIndependently Publish with Us\nAmazon Pay\nHost an Amazon Hub\n›See More Make Money with Us\nAmazon Payment Methods\nInstalments by Barclays\nThe Amazon Barclaycard\nGift Cards\nAmazon Currency Converter\nPayment Methods Help\nShop with Points\nTop Up Your Account\nTop Up Your Account in Store\nLet Us Help You\nCOVID-19 and Amazon\nTrack Packages or View Orders\nDelivery Rates & Policies\nAmazon Prime\nReturns & Replacements\nRecycling\nManage Your Content and Devices\nRecalls and Product Safety Alerts\nAmazon Mobile App\nCustomer Service\nAccessibility\nGift List\n£GBP - Pounds United Kingdom\nAmazon Music\nStream millions\nof songs AbeBooks\nBooks, art\n& collectables ACX\nAudiobook Publishing\nMade Easy Veeqo\nShipping Software\nInventory Management\n  Amazon Web Services\nScalable Cloud\nComputing Services Audible\nDownload Audiobooks Goodreads\nBook reviews\n& recommendations Amazon Home Services\nExperienced pros\nHappiness Guarantee\n  IMDb\nMovies, TV\n& Celebrities Kindle Direct Publishing\nIndie Digital & Print Publishing\nMade Easy Shopbop\nDesigner\nFashion Brands Amazon Resale\nGreat Deals on\nQuality Used Products\n    Amazon Business\nService for\nbusiness customers    \nConditions of Use & Sale\nPrivacy Notice\nCookies Notice\nInterest-Based Ads Notice\n© 1996-2024, Amazon.com, Inc. or its affiliates",
    "capture_time": "2024-10-13 13:30:39"
}